In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('Bengaluru_House_Data.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [4]:
df.duplicated().sum()

529

In [5]:
df.drop_duplicates(inplace=True)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12791 entries, 0 to 13318
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     12791 non-null  object
 1   availability  12791 non-null  object
 2   location      12790 non-null  object
 3   size          12775 non-null  object
 4   society       7463 non-null   object
 5   total_sqft    12791 non-null  object
 6   bath          12718 non-null  float64
 7   balcony       12186 non-null  float64
 8   price         12791 non-null  float64
dtypes: float64(3), object(6)
memory usage: 999.3+ KB

In [7]:
df['price'].unique()

array([ 39.07, 120.  ,  62.  , ...,  40.14, 231.  , 488.  ])

In [8]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

## Lets go one by one and fix all the columns

In [9]:
df['area_type'].unique()                   #apply OHE

array(['Super built-up  Area', 'Plot  Area', 'Built-up  Area',
       'Carpet  Area'], dtype=object)

In [10]:
df['availability'].unique()               #segregate according to months and appply OHE

array(['19-Dec', 'Ready To Move', '18-May', '18-Feb', '18-Nov', '20-Dec',
       '17-Oct', '21-Dec', '19-Sep', '20-Sep', '18-Mar', '20-Feb',
       '18-Apr', '20-Aug', '18-Oct', '19-Mar', '17-Sep', '18-Dec',
       '17-Aug', '19-Apr', '18-Jun', '22-Dec', '22-Jan', '18-Aug',
       '19-Jan', '17-Jul', '18-Jul', '21-Jun', '20-May', '19-Aug',
       '18-Sep', '17-May', '17-Jun', '21-May', '18-Jan', '20-Mar',
       '17-Dec', '16-Mar', '19-Jun', '22-Jun', '19-Jul', '21-Feb',
       'Immediate Possession', '19-May', '17-Nov', '20-Oct', '20-Jun',
       '19-Feb', '21-Oct', '21-Jan', '17-Mar', '17-Apr', '22-May',
       '19-Oct', '21-Jul', '21-Nov', '21-Mar', '16-Dec', '22-Mar',
       '20-Jan', '21-Sep', '21-Aug', '14-Nov', '19-Nov', '15-Nov',
       '16-Jul', '15-Jun', '17-Feb', '20-Nov', '20-Jul', '16-Sep',
       '15-Oct', '15-Dec', '16-Oct', '22-Nov', '15-Aug', '17-Jan',
       '16-Nov', '20-Apr', '16-Jan', '14-Jul'], dtype=object)

In [11]:
df['location'].value_counts()                     #lets drop this column but it is an important parameter

location
Whitefield                        523
Sarjapur  Road                    379
Electronic City                   287
Kanakpura Road                    249
Thanisandra                       229
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: count, Length: 1305, dtype: int64

In [12]:
df['size'].unique()                            #change this to bedroom column and save as a numerical value

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', nan, '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [13]:
# nearly 16 values are missing in size so we will drop the missing rows

In [14]:
df['society'].value_counts().nlargest(50)     #if society name is present assign 1 and 0 if the name is missing

society
GrrvaGr    68
PrarePa    63
Sryalan    56
Prtates    54
GMown E    52
Bhmesy     51
Prarkun    48
IBityin    45
PrityTr    42
Prityel    41
Prtanha    39
Soresea    38
SNity S    38
Dhalsh     37
Adeatlm    37
Soitya     36
Bhe 2ko    34
SNnia E    33
Rosha I    28
RothaVa    27
PuandHi    27
PhestOn    26
MenueNo    26
GoAirej    26
Puachal    25
Prncyrn    25
JRrnauv    24
Dieldli    23
Prlla C    23
Shitt S    23
Itelaa     23
ViistLa    23
DLhtsnd    23
PualeSk    23
Soazak     22
Soiewre    22
Brnia G    21
Brway G    21
DLhtsan    20
Raard B    20
DLhtsen    20
Sodgere    19
SunceEs    19
Shthi S    19
SoechHa    19
AsastDe    18
Prersis    18
Eladero    17
Brica E    17
PueraRi    17
Name: count, dtype: int64

In [15]:
df['bath'].value_counts()                # impute missing values with mean

bath
2.0     6546
3.0     3180
4.0     1198
1.0      762
5.0      520
6.0      271
7.0      102
8.0       64
9.0       42
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: count, dtype: int64

In [16]:
df['balcony'].value_counts()               #impute with mean, cant drop this as >20 %

balcony
2.0    4846
1.0    4700
3.0    1630
0.0    1010
Name: count, dtype: int64

## steps for processing:
1. do all other preprocessing first 
2. apply OHE where needed

In [17]:
df[(df['availability']=='Ready To Move')|(df['availability']=='Immediate Possession')]['availability']='20-Jan'

C:\Users\mrchi\AppData\Local\Temp\ipykernel_12120\3552539956.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[(df['availability']=='Ready To Move')|(df['availability']=='Immediate Possession')]['availability']='20-Jan'

In [18]:
df['availability'].unique()

array(['19-Dec', 'Ready To Move', '18-May', '18-Feb', '18-Nov', '20-Dec',
       '17-Oct', '21-Dec', '19-Sep', '20-Sep', '18-Mar', '20-Feb',
       '18-Apr', '20-Aug', '18-Oct', '19-Mar', '17-Sep', '18-Dec',
       '17-Aug', '19-Apr', '18-Jun', '22-Dec', '22-Jan', '18-Aug',
       '19-Jan', '17-Jul', '18-Jul', '21-Jun', '20-May', '19-Aug',
       '18-Sep', '17-May', '17-Jun', '21-May', '18-Jan', '20-Mar',
       '17-Dec', '16-Mar', '19-Jun', '22-Jun', '19-Jul', '21-Feb',
       'Immediate Possession', '19-May', '17-Nov', '20-Oct', '20-Jun',
       '19-Feb', '21-Oct', '21-Jan', '17-Mar', '17-Apr', '22-May',
       '19-Oct', '21-Jul', '21-Nov', '21-Mar', '16-Dec', '22-Mar',
       '20-Jan', '21-Sep', '21-Aug', '14-Nov', '19-Nov', '15-Nov',
       '16-Jul', '15-Jun', '17-Feb', '20-Nov', '20-Jul', '16-Sep',
       '15-Oct', '15-Dec', '16-Oct', '22-Nov', '15-Aug', '17-Jan',
       '16-Nov', '20-Apr', '16-Jan', '14-Jul'], dtype=object)

In [19]:
# df['availability']=df['availability'].apply(lambda x:'20-Jan' if (x=='Immediate Possession')|(x=='Ready To Move') else x)

In [20]:
# df['availability'].unique()

In [21]:
# from datatime import date

# today=date.today()
# print("Current month:", today.month)

In [22]:
df['availability']=df['availability'].apply(lambda x:1 if (x=='Immediate Possession')|(x=='Ready To Move') else 0)

In [23]:
df['availability'].unique()

array([0, 1], dtype=int64)

In [24]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,0,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,1,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,1,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,1,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,1,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [25]:
df.drop(columns='location',inplace=True)

In [26]:
df.head()

,area_type,availability,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,0,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,1,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,1,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,1,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,1,2 BHK,NaN,1200,2.0,1.0,51.00

In [58]:
df.dropna(subset=["size"], inplace=True)

In [59]:
df['size'].isna().sum()

0

In [61]:
df['size']=df['size'].apply(lambda x:int(x.split(" ")[0]))    #initially it waws not working as there were some NAN values

AttributeError: 'int' object has no attribute 'split'

In [35]:
int(df['size'][0].split(" ")[0])

2

In [48]:
type(df['size'][10])

str

In [62]:
df['size'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [71]:
df[df['society']==]

Empty DataFrame
Columns: [area_type, availability, size, society, total_sqft, bath, balcony, price]
Index: []

In [68]:
df['society'].unique()

array(['Coomee ', 'Theanmp', nan, ..., 'SJovest', 'ThhtsV ', 'RSntsAp'],
      dtype=object)

In [ ]:
df['society']=df['society'].apply(lambda x:0 if x=='Immediate Possession' else 1)